music/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "cHrhGmwMr-tfhdm3ybngow"], ["LIMIT", 1]]
---
    def current_user
        #return the current user
        @current_user ||= User.find_by(session_token: session[:session_token])