music/app/models/user.rb

    def reset_session_token!
        self.session_token = User.generate_session_token
        self.save! #save the session token into the database
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "j-GpDe0q2qiHHLIgFdi31A"], ["updated_at", "2021-02-09 20:30:47.694992"], ["id", 2]]

    def password=(password)
        self.password_digest = BCrypt::Password.create(password)
---
INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"